# ********************************************************************************
# Source : MagicBall.py / Python 3.9
# Created : 10.03.2023 
# Modified : - 
# Author : Евгений Гайворонский
# Description: магический шар 8 (шар судьбы) — шуточный способ предсказывать 
# будущее. Программа должна просить пользователя задать некий вопрос, чтобы 
# случайным образом на него ответить.
# ********************************************************************************

from os import system
from random import randint, seed

# FUNCTIONS 
# ********************************************************************************

def cprint(message): # вывод сообщения по центру окна
	if len(message) < 80:
		print((' ' * ((79 - len(message)) // 2)) + message)

def ask(message, yes, no): 
	ch = ''
	while  ((ch != yes) and (ch != no)):
		ch = input((' ' * ((79 - len(message)) // 2)) + message)
	if ch == no:
		return True
	elif ch == yes:
		return False

def choice(answers):
	return answers[randint(0,len(answers))]

# DATA 
# ********************************************************************************

answers			= ["Бесспорно", "Мне кажется - да", "Пока неясно, попробуй снова", 
				"Даже не думай", "Предрешено", "Вероятнее всего", "Спроси позже", 
				"Мой ответ - нет", "Никаких сомнений", "Хорошие перспективы", 
				"Лучше не рассказывать", "По моим данным - нет", "Можешь быть уверен в этом", 
				"Да", "Сконцентрируйся и спроси опять", "Весьма сомнительно"]
user_name		= ''
user_question	= ''
# START 
# ********************************************************************************

seed(randint(1, 50))
system('mode con cols=80 lines=25')
print()
cprint('Привет!')
cprint('<<< Я МАГИЧЕСКИЙ ШАР >>>')
cprint('Я знаю ответ на любой твой вопрос!')
cprint('Как тебя зовут?')
user_name = str(input())
if user_name == "":
	user_name = 'Аноним'
cprint('Здравствуй, ' + user_name)

while True:
	print('Задай свой вопрос: ', sep='',end='')
	user_question = str(input())
	cprint(choice(answers))
	if (ask(user_name+', хочешь ли ты задать еще вопрос? Да(1)/Нет(2)','1','2')):
		cprint('Возвращайся если возникнут вопросы!')
		break
# END 
# ********************************************************************************
